app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("city", "salt", "zip", "updated_at", "crypted_password", "password_confirmation", "last", "remember_token_expires_at", "first", "street", "dayphone", "remember_token", "evephone", "login", "password", "email", "created_at") VALUES(NULL, '53a9b58dd2ff1993ae3d20d2717272c7719386e0', NULL, '2009-07-02 03:37:39', 'e065c847108991c3ea5833f9283a32ebc7320784', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'lusty', NULL, 'diana@lusty.org', '2009-07-02 03:37:39')